Repository: ep1sode-33/WhisperScribe
Catalog: WhisperScribe/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans, zh_hant

# cleanup.level.raw.title
source: Raw (no LLM)
ja: そのまま（LLM なし）
ko: 원본(LLM 미사용)
zh_hans: 原始（不经过 LLM）
zh_hant: 原始（不經過 LLM）

# cleanup.level.fixOnly.title
source: Fix only
ja: 修正のみ
ko: 수정만
zh_hans: 仅修正
zh_hant: 僅修正

# cleanup.level.cleanPolish.title
source: Clean up + polish
ja: クリーンアップ + 推敲
ko: 정리 + 다듬기
zh_hans: 清理 + 润色
zh_hant: 清理 + 潤色

# cleanup.level.lightEdit.title
source: Polish + light edit
ja: 推敲 + 軽い編集
ko: 다듬기 + 가벼운 편집
zh_hans: 润色 + 轻微编辑
zh_hant: 潤色 + 輕微編輯

# cleanup.level.raw.detail
source: Output the Whisper result directly, without calling the LLM.
ja: Whisper の結果をそのまま出力し、LLM は呼び出しません。
ko: LLM을 호출하지 않고 Whisper 결과를 그대로 출력합니다.
zh_hans: 直接输出 Whisper 结果，不调用 LLM。
zh_hant: 直接輸出 Whisper 結果，不呼叫 LLM。

# cleanup.level.fixOnly.detail
source: Fix punctuation, casing, homophones, and proper nouns/terminology; keep every word and the original wording.
ja: 句読点、大文字小文字、同音語、固有名詞・専門用語を修正します。すべての語と元の言い回しを保持します。
ko: 구두점, 대소문자, 동음이의어, 고유명사/용어를 수정합니다. 모든 단어와 원래 표현을 유지합니다.
zh_hans: 修正标点、大小写、同音词、专有名词/术语；保留全部词语与原始措辞。
zh_hant: 修正標點、大小寫、同音詞、專有名詞/術語；保留全部詞語與原始措辭。

# cleanup.level.cleanPolish.detail
source: On top of "Fix only", remove filler words/stutters, fix grammar, and add paragraph breaks; the meaning is fully preserved.
ja: 「修正のみ」に加えて、フィラー語・どもりを削除し、文法を修正し、段落区切りを追加します。意味は完全に保持されます。
ko: 「수정만」에 더해 군더더기 표현/말더듬을 제거하고 문법을 수정하며 문단 구분을 추가합니다. 의미는 온전히 유지됩니다.
zh_hans: 在「仅修正」基础上删除填充词/口吃、修正语法、添加段落分隔；意思完整保留。
zh_hant: 在「僅修正」基礎上刪除填充詞/口吃、修正語法、新增段落分隔；意思完整保留。

# cleanup.level.lightEdit.detail
source: On top of "Clean up + polish", lightly condense/reorder to improve readability (applies to TXT only; SRT keeps L2 semantics to ensure the timeline stays correct).
ja: 「クリーンアップ + 推敲」に加えて、読みやすさを高めるために軽く要約・並べ替えを行います（TXT のみに適用。SRT は L2 のセマンティクスを維持し、タイムラインが正しく保たれます）。
ko: 「정리 + 다듬기」에 더해 가독성을 높이기 위해 가볍게 요약/재배치합니다(TXT에만 적용. SRT는 L2 의미를 유지하여 타임라인이 올바르게 유지됩니다).
zh_hans: 在「清理 + 润色」基础上轻微精简/重排以提升可读性（仅作用于 TXT；SRT 仍保持 L2 语义，确保时间轴正确）。
zh_hant: 在「清理 + 潤色」基礎上輕微精簡/重排以提升可讀性（僅作用於 TXT；SRT 仍保持 L2 語義，確保時間軸正確）。

# error.noAudioTrack
source: This file does not contain an audio track.
ja: このファイルには音声トラックが含まれていません。
ko: 이 파일에는 오디오 트랙이 없습니다.
zh_hans: 该文件不包含音频轨道。
zh_hant: 該檔案不包含音訊軌道。

# error.audioDecodeFailed
source: Audio decoding failed: %1$@
ja: 音声のデコードに失敗しました：%1$@
ko: 오디오 디코딩에 실패했습니다: %1$@
zh_hans: 音频解码失败：%1$@
zh_hant: 音訊解碼失敗：%1$@

# error.transcriptionFailed
source: Transcription failed: %1$@
ja: 文字起こしに失敗しました：%1$@
ko: 전사에 실패했습니다: %1$@
zh_hans: 转录失败：%1$@
zh_hant: 轉錄失敗：%1$@

# error.writeFailed
source: Failed to write file: %1$@
ja: ファイルの書き込みに失敗しました：%1$@
ko: 파일 쓰기에 실패했습니다: %1$@
zh_hans: 写入文件失败：%1$@
zh_hant: 寫入檔案失敗：%1$@

# error.cancelled
source: Cancelled.
ja: キャンセルされました。
ko: 취소되었습니다.
zh_hans: 已取消。
zh_hant: 已取消。

# output.mode.nextToSource.title
source: Same folder as source file
ja: ソースファイルと同じフォルダ
ko: 원본 파일과 같은 폴더
zh_hans: 与源文件同目录
zh_hant: 與來源檔案同目錄

# output.mode.customFolder.title
source: Custom folder
ja: カスタムフォルダ
ko: 사용자 지정 폴더
zh_hans: 自定义文件夹
zh_hant: 自訂資料夾

# output.overwrite.uniquify.title
source: Keep old file (rename automatically)
ja: 古いファイルを残す（自動でリネーム）
ko: 기존 파일 유지(자동 이름 변경)
zh_hans: 保留旧文件（自动重命名）
zh_hant: 保留舊檔案（自動重新命名）

# output.overwrite.overwrite.title
source: Overwrite file with same name
ja: 同名のファイルを上書き
ko: 같은 이름의 파일 덮어쓰기
zh_hans: 覆盖同名文件
zh_hant: 覆寫同名檔案

# common.chooseFile
source: Choose File…
ja: ファイルを選択…
ko: 파일 선택…
zh_hans: 选择文件…
zh_hant: 選擇檔案…

# settings.title
source: Settings
ja: 設定
ko: 설정
zh_hans: 设置
zh_hant: 設定

# common.appSubtitle
source: Local speech to subtitles
ja: ローカル音声を字幕に変換
ko: 로컬 음성을 자막으로 변환
zh_hans: 本地语音转字幕
zh_hant: 本機語音轉字幕

# common.choose
source: Choose
ja: 選択
ko: 선택
zh_hans: 选择
zh_hant: 選擇

# common.chooseMediaMessage
source: Choose an audio or video file to transcribe
ja: 文字起こしする音声または動画ファイルを選択してください
ko: 전사할 오디오 또는 비디오 파일을 선택하세요
zh_hans: 选择要转录的音频或视频文件
zh_hant: 選擇要轉錄的音訊或視訊檔案

# drop.title
source: Drop an audio/video file
ja: 音声／動画ファイルをドロップ
ko: 오디오/비디오 파일을 끌어다 놓으세요
zh_hans: 拖入音频/视频文件
zh_hant: 拖入音訊／視訊檔案

# drop.subtitle
source: Common audio and video formats supported
ja: 一般的な音声・動画フォーマットに対応
ko: 일반적인 오디오 및 비디오 형식 지원
zh_hans: 支持常见音频与视频格式
zh_hant: 支援常見的音訊與視訊格式

# error.audioTooLong
source: The audio file is too long to process.
ja: 音声ファイルが長すぎて処理できません。
ko: 오디오 파일이 너무 길어 처리할 수 없습니다.
zh_hans: 音频文件过长，无法处理。
zh_hant: 音訊檔案過長，無法處理。

# status.loadingModel
source: Loading Whisper model…
ja: Whisper モデルを読み込み中…
ko: Whisper 모델 로드 중…
zh_hans: 正在加载 Whisper 模型…
zh_hant: 正在載入 Whisper 模型…

# status.extractingAudio
source: Decoding audio…
ja: 音声をデコード中…
ko: 오디오 디코딩 중…
zh_hans: 正在解码音频…
zh_hant: 正在解碼音訊…

# status.transcribing
source: Whisper transcribing…
ja: Whisper で文字起こし中…
ko: Whisper 음성 인식 중…
zh_hans: Whisper 声转文中…
zh_hant: Whisper 語音轉文字中…

# status.cleaning
source: LLM cleaning subtitles…
ja: LLM が字幕を修正中…
ko: LLM이 자막 정리 중…
zh_hans: LLM 修复字幕中…
zh_hant: LLM 修復字幕中…

# common.cancel
source: Cancel
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hant: 取消

# status.preparing
source: Preparing…
ja: 準備中…
ko: 준비 중…
zh_hans: 准备中…
zh_hant: 準備中…

# status.slowModelHint
source: Reasoning models are slower per batch; please be patient
ja: 推論モデルはバッチごとに時間がかかります。しばらくお待ちください
ko: 추론 모델은 배치마다 느립니다. 잠시 기다려 주세요
zh_hans: 推理模型每批较慢，请耐心等待
zh_hant: 推理模型每批較慢，請耐心等待

# status.done
source: Transcription complete
ja: 文字起こし完了
ko: 전사 완료
zh_hans: 转录完成
zh_hant: 轉錄完成

# common.revealInFinder
source: Show in Finder
ja: Finder で表示
ko: Finder에서 보기
zh_hans: 在 Finder 中显示
zh_hant: 在 Finder 中顯示

# status.transcribeAnother
source: Transcribe Another
ja: 別のファイルを文字起こし
ko: 다른 파일 전사
zh_hans: 再转录一个
zh_hant: 再轉錄一個

# settings.transcription
source: Transcription
ja: 文字起こし
ko: 전사
zh_hans: 转录
zh_hant: 轉錄

# settings.language
source: Language
ja: 言語
ko: 언어
zh_hans: 语言
zh_hant: 語言

# settings.language.auto
source: Auto Detect
ja: 自動検出
ko: 자동 감지
zh_hans: 自动检测
zh_hant: 自動偵測

# settings.cleanupLevel
source: Cleanup Level
ja: クリーンアップレベル
ko: 정리 수준
zh_hans: 清理级别
zh_hant: 清理等級

# settings.level
source: Level
ja: レベル
ko: 수준
zh_hans: 级别
zh_hant: 等級

# settings.apiKey
source: API Key
ja: API キー
ko: API 키
zh_hans: API 密钥
zh_hant: API 金鑰

# settings.baseURL
source: Endpoint (base_url)
ja: エンドポイント（base_url）
ko: 엔드포인트(base_url)
zh_hans: 接口地址（base_url）
zh_hant: 介面位址（base_url）

# settings.modelName
source: Model Name
ja: モデル名
ko: 모델 이름
zh_hans: 模型名
zh_hant: 模型名稱

# settings.testConnection
source: Test Connection
ja: 接続をテスト
ko: 연결 테스트
zh_hans: 测试连接
zh_hant: 測試連線

# settings.byokWarning
source: This cleanup level requires an LLM endpoint — until configured, output is exported as raw (L0).
ja: このクリーンアップレベルには LLM エンドポイントが必要です — 設定するまで生（L0）で書き出されます。
ko: 이 정리 수준에는 LLM 엔드포인트가 필요합니다 — 설정하기 전까지 원본(L0)으로 내보냅니다.
zh_hans: 清理级别需要 LLM 端点 — 在补全前将按原始（L0）导出。
zh_hant: 此清理等級需要 LLM 端點 — 在設定完成前將以原始（L0）匯出。

# settings.output
source: Output
ja: 出力
ko: 출력
zh_hans: 输出
zh_hant: 輸出

# settings.outputLocation
source: Output Location
ja: 出力先
ko: 출력 위치
zh_hans: 输出位置
zh_hant: 輸出位置

# settings.noFolderSelected
source: No folder selected
ja: フォルダが選択されていません
ko: 선택된 폴더 없음
zh_hans: 未选择文件夹
zh_hant: 未選擇資料夾

# settings.chooseFolder
source: Choose Folder…
ja: フォルダを選択…
ko: 폴더 선택…
zh_hans: 选择文件夹…
zh_hant: 選擇資料夾…

# settings.sameNameFile
source: Same-Name File
ja: 同名ファイル
ko: 동일 이름 파일
zh_hans: 同名文件
zh_hant: 同名檔案

# settings.chooseFolderMessage
source: Choose a folder for subtitle output
ja: 字幕の出力フォルダを選択してください
ko: 자막 출력 폴더를 선택하세요
zh_hans: 选择字幕输出文件夹
zh_hant: 選擇字幕輸出資料夾

# error.llmNotConfigured
source: LLM endpoint not configured (Base URL and model name required).
ja: LLM エンドポイントが未設定です（Base URL とモデル名を入力してください）。
ko: LLM 엔드포인트가 구성되지 않았습니다(Base URL과 모델 이름을 입력하세요).
zh_hans: 未配置 LLM 端点（需填写 Base URL 与模型名）。
zh_hant: 未配置 LLM 端點（需填寫 Base URL 與模型名稱）。

# error.badBaseURL
source: Base URL is invalid.
ja: Base URL が無効です。
ko: Base URL이 유효하지 않습니다.
zh_hans: Base URL 无效。
zh_hant: Base URL 無效。

# error.httpStatus
source: HTTP status code %1$lld.
ja: HTTP ステータスコード %1$lld。
ko: HTTP 상태 코드 %1$lld.
zh_hans: HTTP 状态码 %1$lld。
zh_hant: HTTP 狀態碼 %1$lld。

# error.emptyResponse
source: Response is empty or could not be parsed.
ja: 応答が空であるか、解析できませんでした。
ko: 응답이 비어 있거나 구문 분석할 수 없습니다.
zh_hans: 响应内容为空或无法解析。
zh_hant: 回應內容為空或無法解析。

# cleanup.status.generatedChars
source: %1$lld characters generated
ja: %1$lld 文字生成済み
ko: %1$lld자 생성됨
zh_hans: 已生成 %1$lld 字
zh_hant: 已生成 %1$lld 字

# cleanup.status.generatedCharsSuffix
source: · %1$lld characters generated
ja: · %1$lld 文字生成済み
ko: · %1$lld자 생성됨
zh_hans: · 已生成 %1$lld 字
zh_hant: · 已生成 %1$lld 字

# cleanup.warning.notConfiguredDegrade
source: LLM endpoint not configured; raw transcript output (L0).
ja: LLM エンドポイントが未設定のため、元の文字起こし（L0）を出力しました。
ko: LLM 엔드포인트가 구성되지 않아 원본 전사(L0)를 출력했습니다.
zh_hans: 未配置 LLM 端点，已输出原始转录（L0）。
zh_hant: 未配置 LLM 端點，已輸出原始轉錄（L0）。

# cleanup.warning.partialFallback
source: Cleaned %1$lld/%2$lld batches; %3$lld of them fell back to raw text.
ja: %2$lld 件中 %1$lld 件のバッチを整理しました（うち %3$lld 件は元のテキストにフォールバック）。
ko: %1$lld/%2$lld개 배치를 정리했으며 그중 %3$lld개 배치는 원본 텍스트로 되돌렸습니다.
zh_hans: 已清理 %1$lld/%2$lld 批，其中 %3$lld 批回退为原始文本。
zh_hant: 已清理 %1$lld/%2$lld 批，其中 %3$lld 批回退為原始文字。

# cleanup.warning.allFallback
source: All batches fell back to raw text; the LLM endpoint may be misconfigured or unavailable.
ja: すべてのバッチが元のテキストにフォールバックしました。LLM エンドポイントの設定が誤っているか、利用できない可能性があります。
ko: 모든 배치가 원본 텍스트로 되돌려졌습니다. LLM 엔드포인트 설정이 잘못되었거나 사용할 수 없을 수 있습니다.
zh_hans: 所有批次均回退为原始文本，LLM 端点可能配置有误或不可用。
zh_hant: 所有批次均回退為原始文字，LLM 端點可能配置有誤或不可用。

# cleanup.warning.txtFallback
source: Prose (TXT) cleanup failed; fell back to segment-by-segment joined text.
ja: 本文（TXT）の整理に失敗したため、セグメントごとに連結したテキストにフォールバックしました。
ko: 본문(TXT) 정리에 실패하여 세그먼트별로 연결한 텍스트로 되돌렸습니다.
zh_hans: 正文（TXT）整理失败，已回退为逐段拼接的文本。
zh_hant: 正文（TXT）整理失敗，已回退為逐段拼接的文字。

# cleanup.status.fixSubtitles
source: Fixing subtitles %1$lld/%2$lld batches
ja: 字幕を修正 %1$lld/%2$lld バッチ
ko: 자막 수정 %1$lld/%2$lld 배치
zh_hans: 已修复字幕 %1$lld/%2$lld 批
zh_hant: 已修復字幕 %1$lld/%2$lld 批

# cleanup.status.polishText
source: Polishing prose %1$lld/%2$lld chunks
ja: 本文を整理 %1$lld/%2$lld ブロック
ko: 본문 정리 %1$lld/%2$lld 청크
zh_hans: 整理正文 %1$lld/%2$lld 块
zh_hant: 整理正文 %1$lld/%2$lld 區塊

# error.audioOutputAddFailed
source: Failed to add audio output
ja: オーディオ出力を追加できませんでした
ko: 오디오 출력을 추가할 수 없습니다
zh_hans: 无法添加音频输出
zh_hant: 無法添加音訊輸出

# error.audioReadStartFailed
source: Failed to start reading audio
ja: オーディオの読み取りを開始できませんでした
ko: 오디오 읽기를 시작할 수 없습니다
zh_hans: 无法开始读取音频
zh_hant: 無法開始讀取音訊

# error.audioDecodeNoFFmpeg
source: Could not decode audio, and ffmpeg was not found
ja: オーディオをデコードできず、ffmpeg も見つかりませんでした
ko: 오디오를 디코딩할 수 없으며 ffmpeg를 찾을 수 없습니다
zh_hans: 无法解码音频，且未找到 ffmpeg
zh_hant: 無法解碼音訊，且未找到 ffmpeg

# error.ffmpegLaunchFailed
source: ffmpeg failed to launch: %1$@
ja: ffmpeg の起動に失敗しました：%1$@
ko: ffmpeg 시작 실패: %1$@
zh_hans: ffmpeg 启动失败：%1$@
zh_hant: ffmpeg 啟動失敗：%1$@

# error.ffmpegDecodeFailed
source: ffmpeg decoding failed (exit code %1$lld)
ja: ffmpeg のデコードに失敗しました（終了コード %1$lld）
ko: ffmpeg 디코딩 실패(종료 코드 %1$lld)
zh_hans: ffmpeg 解码失败（退出码 %1$lld）
zh_hant: ffmpeg 解碼失敗（退出碼 %1$lld）

# error.wavReadFailed
source: Failed to read WAV: %1$@
ja: WAV の読み取りに失敗しました：%1$@
ko: WAV 읽기 실패: %1$@
zh_hans: 读取 WAV 失败：%1$@
zh_hant: 讀取 WAV 失敗：%1$@

# error.decodeEmpty
source: Decoding produced no data
ja: デコード結果が空です
ko: 디코딩 결과가 비어 있습니다
zh_hans: 解码结果为空
zh_hant: 解碼結果為空

# error.audioBufferCreateFailed
source: Failed to create audio buffer
ja: オーディオバッファを作成できませんでした
ko: 오디오 버퍼를 만들 수 없습니다
zh_hans: 无法创建音频缓冲区
zh_hant: 無法建立音訊緩衝區

# error.wavDataReadFailed
source: Failed to read WAV data: %1$@
ja: WAV データの読み取りに失敗しました：%1$@
ko: WAV 데이터 읽기 실패: %1$@
zh_hans: 读取 WAV 数据失败：%1$@
zh_hant: 讀取 WAV 資料失敗：%1$@

# error.wavNoFloatChannel
source: WAV data has no float channel
ja: WAV データに浮動小数点チャンネルがありません
ko: WAV 데이터에 부동 소수점 채널이 없습니다
zh_hans: WAV 数据无浮点声道
zh_hant: WAV 資料無浮點聲道

# settings.model
source: Model
ja: モデル
ko: 모델
zh_hans: 模型
zh_hant: 模型

# model.tagline.bestQuality
source: Best quality
ja: 最高品質
ko: 최고 품질
zh_hans: 质量最佳
zh_hant: 品質最佳

# model.tagline.fast
source: Fast
ja: 高速
ko: 빠름
zh_hans: 快速
zh_hant: 快速

# model.tagline.smallFast
source: Small & fast
ja: 小型・高速
ko: 작고 빠름
zh_hans: 小而快
zh_hant: 小而快

# model.size.large
source: ~1.5 GB
ja: 約 1.5 GB
ko: 약 1.5 GB
zh_hans: 约 1.5 GB
zh_hant: 約 1.5 GB

# model.size.distil
source: ~0.6 GB
ja: 約 0.6 GB
ko: 약 0.6 GB
zh_hans: 约 0.6 GB
zh_hant: 約 0.6 GB

# model.download
source: Download
ja: ダウンロード
ko: 다운로드
zh_hans: 下载
zh_hant: 下載

# model.installed
source: Installed
ja: インストール済み
ko: 설치됨
zh_hans: 已安装
zh_hant: 已安裝

# model.retry
source: Retry
ja: 再試行
ko: 다시 시도
zh_hans: 重试
zh_hant: 重試

# model.delete
source: Delete
ja: 削除
ko: 삭제
zh_hans: 删除
zh_hant: 刪除

# model.storageFootnote
source: Models are stored locally and never re-downloaded.
ja: モデルはローカルに保存され、再ダウンロードされません。
ko: 모델은 로컬에 저장되며 다시 다운로드되지 않습니다.
zh_hans: 模型保存在本地，不会重复下载。
zh_hant: 模型儲存在本機，不會重複下載。

# content.noModel.title
source: No transcription model installed yet
ja: 文字起こしモデルがまだインストールされていません
ko: 아직 설치된 받아쓰기 모델이 없습니다
zh_hans: 还没有安装转录模型
zh_hant: 尚未安裝轉錄模型

# content.noModel.openSettings
source: Open Settings to download
ja: 設定を開いてダウンロード
ko: 설정을 열어 다운로드
zh_hans: 打开设置下载
zh_hant: 開啟設定下載

# error.modelNotInstalled
source: No transcription model installed. Open Settings (⌘,) to download one.
ja: 文字起こしモデルがインストールされていません。設定（⌘,）からダウンロードしてください。
ko: 설치된 받아쓰기 모델이 없습니다. 설정(⌘,)에서 다운로드하세요.
zh_hans: 尚未安装转录模型。请在设置（⌘,）中下载一个。
zh_hant: 尚未安裝轉錄模型。請在設定（⌘,）中下載一個。

# error.modelDownloadFailed
source: Model download failed: %@
ja: モデルのダウンロードに失敗しました：%@
ko: 모델 다운로드 실패: %@
zh_hans: 模型下载失败：%@
zh_hant: 模型下載失敗：%@

# common.ok
source: OK
ko: 확인
zh_hans: 确定
zh_hant: 確定
